app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
								<span class="glyphicon glyphicon-heart" aria-hidden="true"></span>
								<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
							    <span class="glyphicon glyphicon-heart-empty" aria-hidden="true"></span>
						    	<%= book.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
					<!-- コメント機能 -->
					<td><p>コメント数：<%= book.book_comments.count %></p></td>