app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "あああああ"], ["user_id", 3], ["book_id", 14], ["created_at", "2020-08-04 07:23:20.815410"], ["updated_at", "2020-08-04 07:23:20.815410"]]
---
	def create
		@book = Book.find(params[:book_id])
		@comment = @book.book_comments.new(book_comment_params)
		@comment.user_id = current_user.id
		@comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? AND "book_comments"."user_id" = ? LIMIT ?  [["id", 9], ["book_id", 14], ["user_id", 3], ["LIMIT", 1]]
---
	def destroy
		@book = Book.find(params[:book_id])
		BookComment.find_by(id: params[:id], book_id: params[:book_id], user_id: current_user.id).destroy