app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["book_id", 8], ["created_at", "2020-08-05 09:44:07.591690"], ["updated_at", "2020-08-05 09:44:07.591690"]]
---
	def create
		@book = Book.find(params[:book_id])
		@favorite = Favorite.new
		@favorite.book_id = @book.id
		@favorite.user_id = current_user.id
		@favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 7], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 5]]
---
	def destroy
		@book = Book.find(params[:book_id])
		@favorite = current_user.favorites.find_by(book_id: @book.id)
		@favorite.destroy