app/models/book.rb

	def favorited_by?(user)
		#  Favorite.where(user_id: user.id).exits?
		self.favorites.where(user_id: user.id).exists?
---
SELECT  1 AS one FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 8], ["user_id", 3], ["LIMIT", 1]]